package lesson_02;

public class PrimitiveTypes {
    // вход в программу
    public static void main(String[] args) {
        // примитивные типы данных
//        byte
//        short
//        int
//        long
//        float
//        double
//        char
//        boolean


        /**
         * Арифметические операторы
         +  Складывает значения по обе стороны от оператора
         -  Вычитает правый операнд из левого операнда
         *  Умножает значения по обе стороны от оператора
         /  Оператор деления делит левый операнд на правый операнд
         %  Делит левый операнд на правый операнд и возвращает остаток
         ++  Инкремент - увеличивает значение операнда на 1 х++ постфиксная, ++х префиксная
         --  Декремент - уменьшает значение операнда на 1  х-- постфиксная, --х префиксная
         */







    }
}
